erp3l/src/Documents/ЗаявкаНаКомандировку/ЗаявкаНаКомандировку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаКомандировку</name>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ОперативныйПланПоБюджетам</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccumulationRegister.ЛимитыРасходаДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваКВыплате</registerRecords>
  <registerRecords>AccumulationRegister.ЛимитыПоБюджетам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛицевойСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоНазначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Цель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоРешил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОплатыЗаявки</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийРасходов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредполагаемаяСуммаРасходов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>СверхЛимита</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖелательнаяДатаПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокФизЛиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БронироватьБилетыТуда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БронироватьУбытиеТуда</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БронироватьУбытиеТудаНеРаньше</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>БронироватьПрибытиеТуда</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БронироватьПрибытиеТудаНеПозже</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>БронироватьСамолетТуда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БронироватьПоездТуда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БронироватьТрансферТуда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БронироватьМестоТрансфераТуда</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БронироватьБилетыОбратно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БронироватьУбытиеОбратно</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БронироватьУбытиеОбратноНеРаньше</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>БронироватьПрибытиеОбратно</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БронироватьПрибытиеОбратноНеПозже</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>БронироватьСамолетОбратно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БронироватьПоездОбратно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БронироватьТрансферОбратно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БронироватьМестоТрансфераОбратно</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БронироватьПроживание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БронироватьМестоПроживания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БронироватьПроживаниеДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БронироватьПроживаниеДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БронироватьМестПроживания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БронироватьДопИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокСотрудниковСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <comment>(-УХ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперацииУХ</name>
    <type>
      <types>CatalogRef.ВидыОперацийУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПревышениеЛимитов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.ПриоритетыПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнеМаршрута</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПланирования</name>
    <comment>(-УХ)</comment>
    <type>
      <types>DocumentRef.ОперативныйПлан</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КомандируемыеСотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВыдачаПодОтчет</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛицевойСчет</name>
      <type>
        <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПозиции</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/CommonModules/ДенежныеСредстваВызовСервераЛокализация/Module.bsl
//++ Локализация
#Область ПрограммныйИнтерфейс

// Осуществляет разбор выписки банка
//
// Параметры:
// 	ЭлектроннаяВыпискаБанка - Ссылка - Электронная выписка
//
Процедура РазобратьВыпискуБанка(ЭлектроннаяВыпискаБанка) Экспорт
	
	ДенежныеСредстваСерверЛокализация.РазобратьВыпискуБанка(ЭлектроннаяВыпискаБанка);
	
КонецПроцедуры

//++ НЕ УТ

// Осуществляет установку константы КаталогВыгрузкиПодтверждающихДокументов
//
// Параметры:
// 	ЗначениеКонстанты - Строка - Путь к каталогу выгрузки подтверждающих документов
//
Процедура УстановитьЗначениеКонстантыКаталогВыгрузкиПодтверждающихДокументов(ЗначениеКонстанты) Экспорт
	
	Константы.КаталогВыгрузкиПодтверждающихДокументов.Установить(ЗначениеКонстанты);
	
КонецПроцедуры

// Определяет значения заполнения документа "Командировка" на основании "Заявки на командировку"
// 
// Параметры:
//    ДокументОснование - ДокументСсылка.ЗаявкаНаКомандировку - Заявка на командировку
//
// Возвращаемое значение:
//    Структура - Значения заполнения
//
Функция ЗначенияЗаполненияКомандировкиНаОснованииЗаявки(ДокументОснование) Экспорт
	
	РеквизитыОбъекта = Документы.ЗаявкаНаКомандировку.РеквизитыОбъекта(ДокументОснование);
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Организация", РеквизитыОбъекта.Организация);
	ЗначенияЗаполнения.Вставить("Сотрудник", СотрудникПоФизЛицу(РеквизитыОбъекта.Сотрудник, РеквизитыОбъекта.Организация));
	ЗначенияЗаполнения.Вставить("ДатаНачала", РеквизитыОбъекта.ДатаНачала);
	ЗначенияЗаполнения.Вставить("ДатаОкончания", РеквизитыОбъекта.ДатаОкончания);
	ЗначенияЗаполнения.Вставить("ЗаявкаСотрудника", ДокументОснование);
	ЗначенияЗаполнения.Вставить("ЗаполнитьПоПараметрамЗаполнения", Истина);
	
	Возврат ЗначенияЗаполнения;
	
КонецФункции

// Определяет сотрудника по физическому лицу
// 
// Параметры:
//    ФизическоеЛицо - СправочникСсылка.ФизическиеЛица - Физическое лицо
//    Организация - СправочникСсылка.Организации - Организация, в которой работает сотрудник
//
// Возвращаемое значение:
//    СправочникСсылка.Сотрудники, Неопределено - Сотрудник или Неопределено, если установить сотрудника не удалось
// 
Функция СотрудникПоФизЛицу(ФизическоеЛицо, Организация) Экспорт
	
	Результат = Неопределено;
	
	ОсновныеСотрудники = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(
		ФизическоеЛицо, Ложь, Организация, ТекущаяДатаСеанса());
	
	Если ОсновныеСотрудники <> Неопределено И ОсновныеСотрудники.Количество() Тогда
		Результат = ОсновныеСотрудники[0].Сотрудник;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//-- НЕ УТ
#КонецОбласти
//-- Локализация
